# wsEditAddMenu

## Description
Add a menu under Tools -&amp;gt; Third-party. Use dot as a delimiter for sub menus in 'commandName'.

```pascal
PROCEDURE wsEditAddMenu(menuPath : STRING);
```

```python

def vs.wsEditAddMenu(menuPath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|menuPath|STRING||

## Version
Availability: from Vectorworks 2018
## Category
* Workspaces